Merge pull request #6 from jalcim/mermaid
Mermaid
